Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.RoomNotPlacedWarn Property
 [Family] is not placed. Physical properties such as area will display as "Not Placed" in schedules. You can place the [Family] using the option bar in the [Family] tool, or you can delete the [Family] in a schedule. [Room] will be ignored in the energy analysis model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomNotPlacedWarn { get; }
Public Shared ReadOnly Property RoomNotPlacedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomNotPlacedWarn {
	FailureDefinitionId^ get ();
}
static member RoomNotPlacedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace